//
//  main.m
//  05-类与对象
//
//  Created by a on 2019/6/11.
//  Copyright © 2019年 Jamie. All rights reserved.
//


/*
 1. 什么是对象？
    对象是现实生活中的一个具体存在，看得见摸得着，拿过来就可以直接使用。
 
 2. 什么是类？
    物以类聚，人以群分
    类是对一群相同特征或者行为食物的一个统称。抽象的，不能直接使用
 
 3. 类：   对象:（具体到一个对象）
    食物   早上吃的一个苹果
 
 4. 类和对象之间的关系
    类是模板,类的对象是根据这个模板创建出来的。
    类模板中有什么,对象当中就有什么,绝不可能多,也不可能少。
 
 5. 如何设计一个类
    类的作用：用来描述一群具有相同特征和行为的事务
    设计类的三要素：
    1. 类的名字：你要描述这类食物叫什么名字。
    2. 这类事务具有的相同的特征，这类事物拥有什么
    3. 这类事物具有的共同的行为，这类事物会做什么
 
 6. 如何找到类
    名词提炼法：分析整个业务流程，分析出现了哪些名词，这些名词就是你要找的类。
 
    3辆坦克发射了6枚炮弹打中了3架飞机。
 
    坦克类
        特征：型号、大小、颜色、重量、射程
        行为：行驶、发射
    炮弹类
        特征：型号、大小、威力、颜色、重量
        行为：飞、爆炸
 
    飞机类
        特征：型号、作为数量
        行为：飞、爆炸
 
 */
#import <Foundation/Foundation.h>

int main(int argc, const char * argv[]) {

    return 0;
}
